Courses/7140/Lectures/SecureProg/secureProg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Secure Programming</title>
<!-- 2018-05-28 Mon 21:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Software Engineering Lecture"
 />
</head>
<body>
<div id="content">
<h1 class="title">Secure Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 2011 CWE/SANS Top 25 Most Dangerous Software Errors</a></li>
<li><a href="#sec-2">2. Improving Cyber Security</a></li>
<li><a href="#sec-3">3. Opinions on Current Software Quality</a></li>
<li><a href="#sec-4">4. Current Software Quality #2</a></li>
<li><a href="#sec-5">5. Bugs v Vulnerabilities</a>
<ul>
<li><a href="#sec-5-1">5.1. Coding Errors</a></li>
<li><a href="#sec-5-2">5.2. Design Flaws</a></li>
<li><a href="#sec-5-3">5.3. Past Exploits and Their Causes</a></li>
</ul>
</li>
<li><a href="#sec-6">6. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="http://cwe.mitre.org/top25/">2011 CWE/SANS Top 25 Most Dangerous Software Errors</a></h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Improving Cyber Security</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>CPU Architecture
<ol class="org-ol">
<li>Secure Boot
</li>
<li>Executable Address Space
</li>
</ol>
</li>
<li>Network Protocols
<ol class="org-ol">
<li>Redesign of nearly all protocols
</li>
<li>Client/Server Dis-Trust
</li>
<li>Encrypted Packets
</li>
</ol>
</li>
<li>OS Design
<ol class="org-ol">
<li>Process Lineage/ Provenance
</li>
<li>Address Space Layout Randomization
</li>
<li>Control-Flow Integrity
</li>
<li>Detection of Races
</li>
</ol>
</li>
<li>Cryptography
</li>
<li>System Administration
</li>
<li>Software Engineering
</li>
<li>Only SE considered here, all others not
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Opinions on Current Software Quality</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>"Featurism", Performance: Overriding concern, Correctness: some
concern, Security: ??, Privacy: ??
</li>

<li>Secure software development is to prevent software crash/ hang/
misbehave &#x2013; any concern??
</li>

<li>"64% of developers are not confident in their ability to write
secure applications."  Bill Gates, RSA Conference, 2005
</li>

<li>"We wouldn't have to spend so much time and effort on network
security if we didn't have such bad software security." &#x2013; Bruce
Schneier, author of "Applied Cryptography", and "Secrets &amp; Lies:
Digital Security in a Networked World"
</li>

<li>"Malicious hacker's don't create security holes; they simply
exploit them. Security holes and vulnerabilities &#x2013; the real root
cause of the problem &#x2013; are the result of bad software design and
implementation."  &#x2013; John Viega &amp; Gary McGraw, authors of
Building Secure Software, 2001.
</li>

<li>"Have you ever written a program section with a security hole?
How did you know?" &#x2013; Mark G. Graff &amp; Kenneth R. van Wyk, authors of
"Secure Coding: Principles and Practices"
</li>

<li>"There is no software liability &#x2013; no incentive for secure software.
Most developers never learned to produce secure code.  Secure code
often takes a performance hit &#x2013; i.e., the software runs about 1/3
slower &#x2013; something many users don't want to tolerate.  Writing
secure code also takes a lot more time &#x2013; hence, development costs
are higher than usual.  Consequently, the longer development times
and the longer running times discourage developers from writing
secure code."
</li>

<li>from cs.hiram.edu/~obie/cpsc35200/slides/ProgSec1.ppt
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Current Software Quality #2</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Size/Complexity: <a href="http://en.wikipedia.org/wiki/Source_lines_of_code">wikipedia.org
Source lines of code</a> E.g., Windows XP has 40 MLOC
</li>

<li>Typically, 5 - 50 bugs per KLOC ?  Suppose 10% of the bugs result
in security faults.  40,000 KLOC*5*10% = 25,000 security bugs.
</li>

<li>Programming Languages 
<a href="http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html">TIOBE Programming Community Index 2013</a>  Ranks languages. C #1 Java #2
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Bugs v Vulnerabilities</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>A bug is a behavioral deviation from the functional spec.
</li>

<li>A vulnerability is a bug that has "security implications".  See
the section on Past Exploits and Their Causes.
</li>
</ol>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Coding Errors</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Array Index Out of Range (Buffer overflow)
</li>
<li>Formatted strings { &#x2026;; printf("&#x2026;"); &#x2026;}
</li>
<li>Heap overflows 
</li>
<li>Untrusted/tainted input
</li>
<li>Race conditions
</li>
<li>Integer overflow 
</li>
<li>PHP include
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Design Flaws</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Cryptography misuse 
</li>
<li>Lack of compartmentalization
</li>
<li>More privilege used than necessary 
</li>
<li>Relying on secret algorithms
</li>
<li>Sharing resources 
</li>
<li>Usability problems
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Past Exploits and Their Causes</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>Unauthorized Access
</li>
<li>Denial of Service
</li>
<li>Confidential Information leakage 
</li>
<li>Hijacking the Flow of Control 
</li>
<li>Smashing the stack / Arbitrary Code injection 
</li>
<li><a href="http://en.wikipedia.org/wiki/Cross-site_scripting">Cross-site scripting</a> Reference
</li>
<li><a href="http://en.wikipedia.org/wiki/SQL_injection">SQL Injection</a>  Reference
</li>
<li><a href="http://cwe.mitre.org/top25/">2011 CWE/SANS Top 25 Most Dangerous Software Errors</a> Recommended Reading.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>[Book] Introduction to Computer Security, Michael Goodrich, University
of California, Irvine Roberto Tamassia, Brown University, Addison
Wesley, 2011.  Reference
</li>

<li>oracle.com, <a href="http://www.oracle.com/technetwork/java/seccodeguide-139067.html">Secure Coding Guidelines for Java</a>, 2013.  Required Reading <a href="./sec-java-oracle-pm-edited.html">Local Copy</a>
</li>

<li>Prabhaker Mateti, 
<a href="http://www.cs.wright.edu/~pmateti/InternetSecurity/Lectures/SecSoftware/">"Software without Security Holes"</a>, 2012. Required Reading.
</li>

<li>McGraw, Gary, and Ming Chow. "Guest Editors' Introduction:
Safeguarding the Future of Software Security." IEEE Security &amp;
Privacy,  vol 7, no. 3 (2009): 11-12.  PDF accessible via WSU
Library proxy.  Required Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Prabhaker Mateti (<a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
